Repository: ABCDEFGHIJenny/wakemate_flutter
Catalog: lib/l10n/app_*.arb
Languages: id, zh, zh_tw

# languageSettingsTitle
source: Language Settings
id: Pengaturan Bahasa
zh: 语言设定
zh_tw: 語言設定

source: Select Your Language
id: Pilih Bahasa Anda
zh: 选择您的偏好语言
zh_tw: 選擇您的偏好語言

source: Caffeine Intake
id: Asupan Kafein
zh: 咖啡因摄取量
zh_tw: 咖啡因攝取量

source: Sleep Duration
id: Durasi Tidur
zh: 睡眠时数
zh_tw: 睡眠時數

source: Add Record
id: Tambah Catatan
zh: 新增纪录
zh_tw: 新增紀錄

# caffeineIntakeToday
source: Today's Caffeine Intake
id: Asupan Kafein Hari Ini
zh: 今日咖啡因摄取量
zh_tw: 今日咖啡因攝取量

# sleepDurationToday
source: Today's Sleep Duration
id: Durasi Tidur Hari Ini
zh: 今日睡眠时数
zh_tw: 今日睡眠時數

# unitMg
source: mg
zh: 毫克
zh_tw: 毫克

# unitHours
source: hours
id: jam
zh: 小时
zh_tw: 小時

source: Wake Time
id: Waktu Bangun
zh: 清醒时段
zh_tw: 清醒時段

source: Sleep Time
id: Waktu Tidur
zh: 睡眠时段
zh_tw: 睡眠時段

source: Caffeine Log
id: Catatan Kafein
zh: 咖啡因纪录
zh_tw: 咖啡因紀錄

source: Input History
id: Riwayat Input
zh: 输入历史
zh_tw: 輸入歷史

# calculateRecommendation
source: Calculate
id: Hitung Rekomendasi
zh: 计算推荐
zh_tw: 計算推薦

# recommendationHistory
source: History
id: Riwayat Rekomendasi
zh: 推荐结果
zh_tw: 推薦結果
